In [1]:
import pandas as pd
import numpy as np

In [19]:
table_1 = pd.read_excel('A. Google Sheets_Excel.xlsx', sheet_name=0)
table_2 = pd.read_excel('A. Google Sheets_Excel.xlsx', sheet_name=1)
table_1.head()

        Date  Gender Country        Cost
0 2021-08-19  Female      EE  439.230099
1 2021-10-23  Female      UA  304.409672
2 2021-11-07    Male      ID   68.571451
3 2021-10-21  Female      NL  859.288209
4 2021-10-28    Male      FI  434.228491

In [25]:
final_table_1 = table_1.merge(table_2, left_on=['Date', 'Gender', 'Country'], right_on=['Date', 'Gender', 'Country'])
final_table_1['ROAS'] = final_table_1['Revenue'] / final_table_1['Cost']
final_table_1.head()

        Date  Gender Country        Cost     Revenue      ROAS
0 2021-10-21  Female      NL  859.288209  250.022329  0.290964
1 2021-10-28    Male      FI  434.228491  434.822457  1.001368
2 2021-08-04  Female      MX  863.948960  268.955288  0.311309
3 2021-09-01  Female      ES  866.299453  144.263409  0.166528
4 2021-08-13    Male      RO  647.037644  279.488177  0.431950

In [26]:
final_table_2 = table_1.merge(table_2, left_on=['Date', 'Country'], right_on=['Date', 'Country'])
final_table_2['ROAS'] = final_table_2['Revenue'] / final_table_2['Cost']
final_table_2.drop(columns=['Gender_x', 'Gender_y'], inplace=True)
final_table_2.head()

        Date Country        Cost     Revenue      ROAS
0 2021-10-23      UA  304.409672  459.176050  1.508415
1 2021-10-23      UA  304.409672   77.524673  0.254672
2 2021-10-21      NL  859.288209  250.022329  0.290964
3 2021-10-28      FI  434.228491  434.822457  1.001368
4 2021-08-04      MX  863.948960  268.955288  0.311309